-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Апр 30 2024 г., 14:35
-- Версия сервера: 10.4.27-MariaDB
-- Версия PHP: 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `remont_db`
--

-- --------------------------------------------------------

--
-- Структура таблицы `doljnost`
--

CREATE TABLE `doljnost` (
  `id_dolj` int(11) NOT NULL,
  `name_dolj` tinytext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `doljnost`
--

INSERT INTO `doljnost` (`id_dolj`, `name_dolj`) VALUES
(1, 'Инженер'),
(10, 'Главный инженер');

-- --------------------------------------------------------

--
-- Структура таблицы `loco`
--

CREATE TABLE `loco` (
  `id_l` int(11) NOT NULL,
  `name_l` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `loco`
--

INSERT INTO `loco` (`id_l`, `name_l`) VALUES
(1, 'BR232'),
(2, 'BR120'),
(3, 'M62	\r\n'),
(4, 'CHME3'),
(5, 'BR120 - 6'),
(6, 'М62 РЖД - 4');

-- --------------------------------------------------------

--
-- Структура таблицы `repair`
--

CREATE TABLE `repair` (
  `id_r` int(11) NOT NULL,
  `sotrudnik` int(11) NOT NULL,
  `typeloco` int(11) NOT NULL,
  `number_loco` varchar(255) NOT NULL,
  `comments` text NOT NULL,
  `date_repair` date NOT NULL,
  `type` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `repair`
--

INSERT INTO `repair` (`id_r`, `sotrudnik`, `typeloco`, `number_loco`, `comments`, `date_repair`, `type`) VALUES
(1, 4, 2, '123456', 'Проверка', '2023-12-12', 'Техническое обслуживание'),
(2, 4, 3, '343434-45', 'Отремонтирован', '2024-02-01', 'Техническое обслуживание'),
(3, 4, 3, '32323', 'Отремонтирован', '2024-03-01', 'Техническое обслуживание'),
(4, 4, 3, '343434-45', 'Отремонтирован', '2024-04-01', 'Капитальный ремонт'),
(5, 4, 2, 'ВЛ19', '', '2024-04-22', 'Капитальный ремонт');

-- --------------------------------------------------------

--
-- Структура таблицы `repair_spareparts`
--

CREATE TABLE `repair_spareparts` (
  `idr` int(11) NOT NULL,
  `idspa` int(11) NOT NULL,
  `count` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `repair_spareparts`
--

INSERT INTO `repair_spareparts` (`idr`, `idspa`, `count`) VALUES
(4, 38, 1),
(4, 46, 1),
(4, 54, 5),
(5, 19, 1),
(5, 30, 1),
(5, 31, 1),
(5, 35, 5);

-- --------------------------------------------------------

--
-- Структура таблицы `sotr_dolj`
--

CREATE TABLE `sotr_dolj` (
  `ids` int(11) NOT NULL,
  `idd` int(11) NOT NULL,
  `date_add` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `sotr_dolj`
--

INSERT INTO `sotr_dolj` (`ids`, `idd`, `date_add`) VALUES
(3, 3, '2022-04-19 08:06:29'),
(5, 3, '2022-11-18 10:13:01'),
(6, 1, '2024-04-12 06:35:05'),
(1, 1, '2024-04-28 20:40:19'),
(10, 1, '2024-04-28 20:40:31'),
(11, 1, '2024-04-28 20:40:40'),
(4, 10, '2024-04-30 12:35:27');

-- --------------------------------------------------------

--
-- Структура таблицы `spareparts`
--

CREATE TABLE `spareparts` (
  `id_sp` int(11) NOT NULL,
  `name_sp` varchar(250) NOT NULL,
  `number` varchar(50) NOT NULL,
  `type_loco` int(11) NOT NULL,
  `count_all` int(11) NOT NULL,
  `date_add` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `spareparts`
--

INSERT INTO `spareparts` (`id_sp`, `name_sp`, `number`, `type_loco`, `count_all`, `date_add`) VALUES
(1, 'Мотор', '85091', 1, 0, '2024-04-28 21:22:26'),
(2, 'Червяк', '101242', 1, 70, '2024-04-28 21:22:26'),
(3, 'Кол-пара с резинкой', '140682', 1, 14, '2024-04-28 21:22:26'),
(4, 'Кол-пара без резинки', '140861', 1, 2, '2024-04-28 21:22:26'),
(5, 'Шестеренка 1', '86418', 1, 25, '2024-04-28 21:22:26'),
(6, 'Шестеренка 2', '86419', 1, 39, '2024-04-28 21:22:26'),
(7, 'Шестеренка 3', '86460', 1, 32, '2024-04-28 21:22:26'),
(8, 'Шестеренка 4', '86480', 1, 85, '2024-04-28 21:22:26'),
(9, 'Редуктор', '101244', 1, 26, '2024-04-28 21:22:26'),
(10, 'Кардан', '101240', 1, 13, '2024-04-28 21:22:26'),
(11, 'Плата', '140680', 1, 3, '2024-04-28 21:22:26'),
(12, 'Крышка Редуктора', '96401', 1, 0, '2024-04-28 21:22:26'),
(13, 'Токосъем', '89956', 1, 0, '2024-04-28 21:22:26'),
(14, 'Держатель токосъема', '136622', 1, 15, '2024-04-28 21:22:26'),
(15, 'Световые трубки', '101236', 1, 0, '2024-04-28 21:22:26'),
(16, 'Пружинки', '116876', 1, 26, '2024-04-28 21:22:26'),
(17, 'Винтики платы', '114966', 1, 40, '2024-04-28 21:22:26'),
(18, 'Чашка кардана', '87129', 1, 12, '2024-04-28 21:22:26'),
(19, 'Мотор', '146020', 2, 11, '2024-04-28 21:22:26'),
(20, 'Червяк', '114826', 2, 33, '2024-04-28 21:22:26'),
(21, 'Кол-пара с резинкой', '141866', 2, 0, '2024-04-28 21:22:26'),
(22, 'Кол-пара без резинки', '121396', 2, 50, '2024-04-28 21:22:26'),
(23, 'Шестеренка 1', '111679', 2, 23, '2024-04-28 21:22:26'),
(24, 'Шестеренка 2', '86490', 2, 127, '2024-04-28 21:22:26'),
(25, 'Шестеренка 3', '106722', 2, 80, '2024-04-28 21:22:26'),
(26, 'Шестеренка 4', '86480', 2, 85, '2024-04-28 21:22:26'),
(27, 'Редуктор', '121344', 2, 24, '2024-04-28 21:22:26'),
(28, 'Кардан', '100075', 2, 20, '2024-04-28 21:22:26'),
(29, 'Плата', '146220', 2, 2, '2024-04-28 21:22:26'),
(30, 'Крышка Редуктора', '114820', 2, 14, '2024-04-28 21:22:26'),
(31, 'Токосъем', '114832', 2, 49, '2024-04-28 21:22:26'),
(32, 'Держатель токосъема', '121335', 2, 0, '2024-04-28 21:22:26'),
(33, 'Световые трубки', '140396', 2, 23, '2024-04-28 21:22:26'),
(34, 'Пружинки', '145560', 2, 12, '2024-04-28 21:22:26'),
(35, 'Винтики', '114828', 2, 45, '2024-04-28 21:22:26'),
(36, 'Винтики платы', '114966', 2, 12, '2024-04-28 21:22:26'),
(37, 'Чашка кардана', '87129', 2, 0, '2024-04-28 21:22:26'),
(38, 'Мотор', '85111', 3, 22, '2024-04-28 21:22:26'),
(39, 'Червяк', '114826', 3, 33, '2024-04-28 21:22:26'),
(40, 'Кол-пара с резинкой', '121395', 3, 0, '2024-04-28 21:22:26'),
(41, 'Кол-пара без резинки', '121396', 3, 50, '2024-04-28 21:22:26'),
(42, 'Шестеренка 1', '111679', 3, 23, '2024-04-28 21:22:26'),
(43, 'Шестеренка 2', '86490', 3, 127, '2024-04-28 21:22:26'),
(44, 'Шестеренка 3', '106722', 3, 80, '2024-04-28 21:22:26'),
(45, 'Шестеренка 4', '86480', 3, 85, '2024-04-28 21:22:26'),
(46, 'Редуктор', '133438', 3, 20, '2024-04-28 21:22:26'),
(47, 'Кардан', '107011', 3, 14, '2024-04-28 21:22:26'),
(48, 'Плата', '127562', 3, 14, '2024-04-28 21:22:26'),
(49, 'Крышка Редуктора', '114820', 3, 17, '2024-04-28 21:22:26'),
(50, 'Токосъем', '114832', 3, 50, '2024-04-28 21:22:26'),
(51, 'Держатель токосъема', '133441', 3, 40, '2024-04-28 21:22:26'),
(52, 'Световые трубки', '140396', 3, 23, '2024-04-28 21:22:26'),
(53, 'Пружинки', '116876', 3, 21, '2024-04-28 21:22:26'),
(54, 'Винтики', '114828', 3, 50, '2024-04-28 21:22:26'),
(55, 'Винтики платы', '114966', 3, 12, '2024-04-28 21:22:26'),
(56, 'Чашка кардана', '87129', 3, 0, '2024-04-28 21:22:26'),
(57, 'Мотор', '136206', 4, 19, '2024-04-28 21:22:26'),
(58, 'Червяк', '136196', 4, 0, '2024-04-28 21:22:26'),
(59, 'Кол-пара с резинкой', '136205', 4, 0, '2024-04-28 21:22:26'),
(60, 'Кол-пара без резинки', '136199', 4, 0, '2024-04-28 21:22:26'),
(61, 'Шестеренка 1', '86419', 4, 85, '2024-04-28 21:22:26'),
(62, 'Шестеренка 2', '111115', 4, 44, '2024-04-28 21:22:26'),
(63, 'Шестеренка 3', '117617', 4, 108, '2024-04-28 21:22:26'),
(64, 'Редуктор', '136201', 4, 18, '2024-04-28 21:22:26'),
(65, 'Кардан', '100260', 4, 23, '2024-04-28 21:22:26'),
(66, 'Плата', '136208', 4, 0, '2024-04-28 21:22:26'),
(67, 'Крышка Редуктора', '136305', 4, 0, '2024-04-28 21:22:26'),
(68, 'Токосъем', '136204', 4, 0, '2024-04-28 21:22:26'),
(69, 'Световые трубки', '136191', 4, 0, '2024-04-28 21:22:26'),
(70, 'Пружинки', '116876', 4, 0, '2024-04-28 21:22:26'),
(71, 'Винтики', '114850', 4, 0, '2024-04-28 21:22:26'),
(72, 'Мотор', '146020', 5, 12, '2024-04-28 21:27:07'),
(73, 'Червяк', '114826', 5, 50, '2024-04-28 21:27:07'),
(74, 'Кол-пара с резинкой', '121395', 5, 23, '2024-04-28 21:27:07'),
(75, 'Кол-Пара без резинки', '141867', 5, 0, '2024-04-28 21:27:07'),
(76, 'Кол-Пара без резинки', '121396', 5, 50, '2024-04-28 21:27:07'),
(77, 'Шестеренка', '111679', 5, 23, '2024-04-28 21:27:07'),
(78, 'Шестеренка', '106722', 5, 80, '2024-04-28 21:27:07'),
(79, 'Шестеренка', '86480', 5, 85, '2024-04-28 21:27:07'),
(80, 'Шестеренка', '86490', 5, 127, '2024-04-28 21:27:07'),
(81, 'Редуктор', '121344', 5, 24, '2024-04-28 21:27:07'),
(82, 'Кардан', '100075', 5, 20, '2024-04-28 21:27:07'),
(83, 'Плата', '146220', 5, 24, '2024-04-28 21:27:07'),
(84, 'Крышка Редуктора', '114820', 5, 38, '2024-04-28 21:27:07'),
(85, 'Токосъем', '114832', 5, 50, '2024-04-28 21:27:07'),
(86, 'Токосъем', '116103', 5, 0, '2024-04-28 21:27:07'),
(87, 'Держатель токосъема', '133441', 5, 40, '2024-04-28 21:27:07'),
(88, 'Шлейф фар', '140396', 5, 23, '2024-04-28 21:27:07'),
(89, 'Пружинки', '145560', 5, 11, '2024-04-28 21:27:07'),
(90, 'Пружинки', '145561', 5, 12, '2024-04-28 21:27:07'),
(91, 'Винтики', '114828', 5, 37, '2024-04-28 21:27:07'),
(92, 'Винтики', '114836', 5, 21, '2024-04-28 21:27:07'),
(93, 'Винтики платы', '114966', 5, 12, '2024-04-28 21:27:07'),
(94, 'Чашка кардана', '87129', 5, 12, '2024-04-28 21:27:07'),
(95, 'Подложка под двигатель', '146219', 5, 6, '2024-04-28 21:27:07'),
(96, 'Держатель сцепки', '121335', 5, 8, '2024-04-28 21:27:07'),
(97, 'Держатель сцепки', '133435', 5, 0, '2024-04-28 21:27:07'),
(98, 'Обвес на редуктор', '141854', 5, 25, '2024-04-28 21:27:07'),
(99, 'Мотор', '85111', 6, 22, '2024-04-28 21:29:06'),
(100, 'Редуктор', '133438', 6, 20, '2024-04-28 21:29:06'),
(101, 'Редуктор', '116107', 6, 0, '2024-04-28 21:29:06'),
(102, 'Кардан', '107011', 6, 14, '2024-04-28 21:29:06'),
(103, 'Плата', '127562', 6, 14, '2024-04-28 21:29:06'),
(104, 'Шлейф фар', '114825', 6, 30, '2024-04-28 21:29:06'),
(105, 'Пружинки', '116876', 6, 21, '2024-04-28 21:29:06'),
(106, 'Подложка под двигатель', '106116', 6, 18, '2024-04-28 21:29:06');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `fio` varchar(200) NOT NULL,
  `login` varchar(100) NOT NULL,
  `pass` varchar(100) NOT NULL,
  `email` varchar(250) DEFAULT NULL,
  `adress` varchar(255) NOT NULL,
  `role` int(11) NOT NULL DEFAULT 0,
  `date_reg` timestamp NOT NULL DEFAULT current_timestamp(),
  `phone` varchar(250) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci ROW_FORMAT=COMPACT;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `fio`, `login`, `pass`, `email`, `adress`, `role`, `date_reg`, `phone`) VALUES
(1, 'Глебов Иван Романович', 'gleb', '12345', 'gleb@ya.ru', '', 2, '2021-03-10 21:00:00', '54545454'),
(4, 'Сергеев Николай Ильич', 'admin', 'pwd13pwd', '', '', 1, '2021-03-11 08:00:00', '2323'),
(6, 'Плахов Николай Алексеевич', 'plah', '1233', 'plah@ya.ru', '', 2, '2021-03-11 12:41:02', '3434'),
(10, 'Домин Александр Дмитриевич', 'dom', '12345', '', '', 2, '2022-04-18 09:08:11', '4545'),
(11, 'Жилин Иван Геннадьевич', 'gil', '12345', 'gil@ya.ru', '', 2, '2022-04-19 08:03:07', '454545');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `doljnost`
--
ALTER TABLE `doljnost`
  ADD PRIMARY KEY (`id_dolj`);

--
-- Индексы таблицы `loco`
--
ALTER TABLE `loco`
  ADD PRIMARY KEY (`id_l`);

--
-- Индексы таблицы `repair`
--
ALTER TABLE `repair`
  ADD PRIMARY KEY (`id_r`);

--
-- Индексы таблицы `repair_spareparts`
--
ALTER TABLE `repair_spareparts`
  ADD PRIMARY KEY (`idr`,`idspa`);

--
-- Индексы таблицы `spareparts`
--
ALTER TABLE `spareparts`
  ADD PRIMARY KEY (`id_sp`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `doljnost`
--
ALTER TABLE `doljnost`
  MODIFY `id_dolj` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT для таблицы `loco`
--
ALTER TABLE `loco`
  MODIFY `id_l` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `repair`
--
ALTER TABLE `repair`
  MODIFY `id_r` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `spareparts`
--
ALTER TABLE `spareparts`
  MODIFY `id_sp` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=107;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
